# 3. SQL Intermediate Queries

## 3.1 Aggregate function

Aggregate functions perform calculations on a set of values, and returns a single value. These functions allow us to perform calculations on the data in a database.

- Aggregate functions are often used with the `GROUP BY` clause of the `SELECT` statement.
- All aggregate functions are deterministic. In other words, aggregate functions return the same value each time that they are called, when called with a specific set of input values.

### 3.1.1 Basic aggregate operations

Example:

```sql
# Average value from the age column of the customers table.
SELECT AVG(age)
FROM customers;

# Maximum value from the age column of the customers table.
SELECT MAX(age)
FROM customers;

# Sum of the age column of the customers table.
SELECT SUM(age)
FROM customers;

# Min of the age column of the customers table.
SELECT MIN(age)
FROM customers;
```

### 3.1.1 Aggregate functions with `WHERE`

Aggregate functions can be combined with the `WHERE` clause, so that calculations are performed based on desired data filters.

```sql
# Get the total orders made from customers older than 30
SELECT SUM(orders)
FROM customers
WHERE age >= 30;

#Get the number of customers whose names start with the letter 'A'.
SELECT COUNT(*)
FROM customers
WHERE name LIKE 'A%';

# Get the amount of orders made from highest buying customers between 20 and 25 yo
SELECT MAX(orders)
FROM customers
WHERE age BETWEEN 20 AND 25;
```

### 3.1.2. Basic arithmetic operations

Arithmetic operators can perform arithmetical operations on numeric operands involved. In essence, you can perform basic arithmetic with symbols like `+`, `-`, `*`, and `/`.

! The division operator will always return a number with the a precision similar to the one of the most precise operand. E.g.

```sql
SELECT (4 / 3);
>>> 1

SELECT (4.0 / 3.0);
>>> 1.333
```

### 3.1.3 `AS` command

The AS command is used to rename a column or table with an alias. An alias only exists for the duration of the query.

```sql
SELECT MAX(age) AS max_age,
       MAX(order) AS max_order
FROM customers;
```

```sql
SELECT name,
       (order - return) AS net_purchases
FROM customers;
```

## 3.2 Table manipulation

Sort and group tables and results to gain further insight.


#### 3.2.1 `ORDER BY`

The `ORDER BY` keyword is used to sort results in ascending or descending order according to the values of one or more columns.

By default `ORDER BY` will sort in ascending order. If you want to sort the results in descending order, you can use the `DESC` keyword.

```sql
SELECT name
FROM customers
ORDER BY age DESC;


SELECT name
FROM customers
WHERE country IN ('China', 'Taiwan')
ORDER BY age;

# In descending order
SELECT name
FROM customers
WHERE country IN ('China', 'Taiwan')
ORDER BY age DESC;
```

`ORDER BY` can also be used to sort on multiple columns. It will sort by the first column specified, then sort by the next, then the next, and so on. The order of columns is important.

```sql
# In descending order
SELECT name
FROM customers
ORDER BY orders, age;
```
| customer_id | order | age |
|-------------|-------|-----|
| 123         | 1     | 19  |
| 2123        | 1     | 20  |
| 12          | 1     | 28  |
| 43          | 3     | 15  |
| 34          | 3     | 22  |
| 123         | 4     | 20  |

### 3.2.2 `GROUP BY`

The GROUP BY clause allows you to group rows based on values of one or more columns. It returns one row for each group.



For example, you can group all the males together and count them, and group all the females together and count them:

```
SELECT gender, COUNT(*)
FROM customers
GROUP BY gender;
```
| gender | count |
|--------|-------|
| male   | 15    |
| female | 19    |

The `GROUP BY` statement is often used with aggregate functions (`COUNT()`, `MAX(`, `MIN()`, `SUM()`, `AVG()`) to group the result-set by one or more columns.

**!** SQL will return an error if you try to `SELECT` a field that is not in your GROUP BY clause without using it to calculate some kind of value about the entire group. Example:
```
SELECT name, COUNT(*)
FROM customers
GROUP BY gender;
>>> column "customers.name" must appear in the GROUP BY clause or be used in an aggregate function
LINE 1: SELECT name, COUNT(*)
```

### 3.2.3 `GROUP BY` and `ORDER BY`

YOu can combine GROUP BY and ORDER BY with aggregate functions.

Make sure to always put the ORDER BY clause at the end of your query (you can't sort values that you haven't calculated yet).

```
SELECT gender, country, MAX(age)
FROM customers
GROUP BY order, gender
ORDER BY order, gender;
```

| order | gender | order |
|-------|--------|-------|
| 3     |    M   |   76  |
| 3     |    F   |   58  |
| 12    |    M   |   45  |
| 12    |   F    |  35   |
| 34    |   M    |   24  |
| 34    |   F    |   19  |

In essence, the fields that are `SELECT`ed and not aggregated (e.g. `COUNT`), must be part of the GROUP BY clause.

### 3.2.4 `HAVING` clause

The HAVING clause was added to SQL because the `WHERE` keyword cannot be used with aggregate functions.

```sql
WHERE COUNT(age) >= 18; -- Nope
HAVING COUNT(age) >= 18; -- Yope
```

For example, if you wanted to group all the  adult males together and count them, and group all the adult females together and count them, you would need to do the following:

```sql
-- WHERE can't be used with aggregate functions:
SELECT gender, COUNT(*)
FROM customers
GROUP BY gender
WHERE COUNT(age) >= 18;
>>> ERROR

-- HAVING can be used with aggregate functions:
SELECT gender, COUNT(*)
FROM customers
GROUP BY gender
HAVING COUNT(age) >= 18;
```
Notice that `HAVING` needs to take place after `GROUP BY` operations.

## 3.3 Bigger Queries


### 3.3.1 Big Query

A real-world example may be: get the country, average age, and average orders of countries that have made more than 10 customers. Order the result by country name, and limit the number of results displayed to 5. You should alias the averages as avg_age and avg_orders respectively.

```sql
SELECT country,
       AVG(age) AS avg_age,
       AVG(order) AS avg_orders
FROM customers
GROUP BY country
HAVING COUNT(country) > 10
ORDER BY country
LIMIT 5;
```
SQL basically provides you a bunch of building blocks that you can combine in all kinds of ways.


### 3.3.2 Quering multiple tables

In the real world you will often want to query multiple tables. For example, what if you want to see the number of orders score for a customer that exists in the customer table of a banks' credit score.

In this case, you'd want to get the ID of the customer from the customers table and then use it to get credit score information from the banks table. In SQL, this concept is known as a **join**, and a basic join is shown in the editor to the right.

```sql
SELECT name, credit_score
FROM customers
JOIN banks
ON customers.id = banks.customer_id
WHERE name = 'Yuv Binponned';
```

## 3.4 SQL Flavours

- Free or paid
- All used with relational databasses
- Keywords are the same
- Must follow universal standards
- Additions on top of these standards make flavours different

Some flavours:
1. 3.1 PostgreSQL (University California Berkeley and DARPA)
2. SQL Servers (Microsoft)

```sql
-- PostgreSQL
SELECT id, name
FROM customers
LIMIT 2;

-- SQL Server
SELECT id, name
FROM customers
TOP 2;
```